Catalogs/ИА_БПКартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПКартыМаршрутов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПКартыМаршрутов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура Заполнить_ТабКэшДанных()
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Т.Ссылка КАК Точка,
    |   Т.Тип,
    |   Т.Имя,
    |   Т.Ответственный,
    |   Т.ВариантДлительности,
    |   Т.ДлительностьВыполнения,
    |   Т.Описание,
    |   Т.Ответственный КАК Пояснение
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК Т
    |ГДЕ
    |   Т.Владелец = &Владелец";
    Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
    ТЗ = Запрос.Выполнить().Выгрузить();
    ТабКэшДанных.Загрузить(ТЗ);    
КонецПроцедуры

&НаСервере
Процедура СформироватьКоличествоБП()
    Колво = 0;
	Если НЕ Объект.Ссылка.Пустая() Тогда
    	М = Справочники.ИА_БПКартыМаршрутов.ПолучитьСписокБППоКартеМаршрута(Объект.Ссылка, "Стартован И НЕ Завершен");
        Колво = М.Количество();
    КонецЕсли;
    
    Если Колво = 0 Тогда
    	Элементы.НадписьБП.Заголовок = "Выполняемых процессов нет";
    Иначе
        Элементы.НадписьБП.Заголовок = "Выполняемых процессов: " + Колво;
    КонецЕсли; 
    
КонецПроцедуры
 

//_____________________________________________________________

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.ПолеГрафСхема.ТолькоПросмотр = НЕ РежимРедактирования;
    Элементы.ГруппаНастройкиБлока.Видимость = НЕ РежимРедактирования;
    
    ////ГрафСхема.РежимОтрисовкиСетки = ?(РежимРедактирования
    ////, РежимОтрисовкиСеткиГрафическойСхемы.ШахматнаяСетка
    ////, РежимОтрисовкиСеткиГрафическойСхемы.Точки
    ////);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвязанныеРеквизиты(ИмяЭлемента)
    Если РежимРедактирования Тогда
    	Возврат;
    КонецЕсли;
    АктивныйЭлемент = ИмяЭлемента;
    Ответственный = Неопределено;
	Подсказка = "";
    
    Эл = ГрафСхема.ЭлементыГрафическойСхемы.Найти(АктивныйЭлемент);
    Если Эл = Неопределено
        ИЛИ НЕ ЗначениеЗаполнено(ИмяЭлемента)
        Тогда
    	Возврат;
    КонецЕсли; 
    
    М = ТабКэшДанных.НайтиСтроки(Новый Структура("Имя", ИмяЭлемента));
    Если М.Количество() = 0 Тогда
    	Заполнить_ТабКэшДанных();
        М = ТабКэшДанных.НайтиСтроки(Новый Структура("Имя", ИмяЭлемента));
    КонецЕсли; 
    
    Если М.Количество() > 0 Тогда
    	СтрокаК = М[0];
        ТочкаМаршрута = СтрокаК.Точка;
    //    Ответственный = СтрокаК.Ответственный;        
    //	Подсказка = СтрокаК.Описание;
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТочку(ИмяТочки)
    Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
    	ЭтаФорма.Записать();
    КонецЕсли; 
    
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Точка = ПолучитьТочкуНаСервере(ИмяТочки);
        П = Новый Структура("ТолькоПросмотр, Ключ", ЭтаФорма.ТолькоПросмотр, Точка);
        ОткрытьФорму("Справочник.ИА_БПТочкиМаршрута.ФормаОбъекта", П);
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьТочкуНаСервере(ИмяТочки)
    Точка = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочку(Объект.Ссылка, ИмяТочки);
    Возврат Точка;    
КонецФункции
 
&НаСервере
Процедура ЗаполнитьГрафСхему()
    Для каждого Эл Из ГрафСхема.ЭлементыГрафическойСхемы Цикл
        Если ИА_БФКС.РеквизитЕсть(Эл, "Пояснение") Тогда
            М = ТабКэшДанных.НайтиСтроки(Новый Структура("Имя", Эл.Имя) );
            Если М.Количество() > 0 Тогда
                Эл.Пояснение = М[0].Пояснение;
            КонецЕсли; 
        КонецЕсли; 
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеГрафСхемыНачать()
    ГрафСхемаКопия = ГрафСхема;
    ГрафСхема = Неопределено;
    ПодключитьОбработчикОжидания("ОбновлениеГрафСхемыЗакончить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеГрафСхемыЗакончить()
    ГрафСхема = ГрафСхемаКопия;
КонецПроцедуры

//_____________________________________________________________


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
    
    Если Параметры.Свойство("ЗначениеКопирования") Тогда
    	ОбъектКопирования = Параметры.ЗначениеКопирования;
    КонецЕсли;
    
    Если Параметры.Свойство("ТолькоПросмотр")
        И ТипЗнч(Параметры.ТолькоПросмотр) = Тип("Булево") Тогда
    	Элементы.РежимРедактирования.ТолькоПросмотр = Параметры.ТолькоПросмотр;
    КонецЕсли; 
    
    Заполнить_ТабКэшДанных();
    ЗаполнитьГрафСхемуИзМД();
    СформироватьКоличествоБП();
    
    Контекст = Новый Структура("Параметры, Объект, Форма", Параметры, Объект, ЭтаФорма);
    ИА_БПСПереопределяемый.Формы_Карта_Маршрут_ПриСозданииНаСервере(Контекст);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафСхемуИзМД()
    Об = РеквизитФормыВЗначение("Объект");
    Карта = Об.Карта.Получить();
    Если Карта <> Неопределено Тогда
        ГрафСхема = Карта;	
    ИначеЕсли ЗначениеЗаполнено(ОбъектКопирования) Тогда
        СтараяКарта = ОбъектКопирования.ПолучитьОбъект().Карта.Получить();
        Если СтараяКарта = Неопределено Тогда
            ГрафСхема = Новый ГрафическаяСхема;
        Иначе
            ГрафСхема = СтараяКарта;
        КонецЕсли; 
    Иначе
        ГрафСхема = Новый ГрафическаяСхема;
    КонецЕсли;
    
    ЗаполнитьГрафСхему();
КонецПроцедуры
 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    ТекущийОбъект.Карта = Новый ХранилищеЗначения(ГрафСхема);
    Если ЗначениеЗаполнено(ОбъектКопирования) Тогда
        ТекущийОбъект.ДополнительныеСвойства.Вставить("ИА_ОбъектКопирования", ОбъектКопирования);
        ОбъектКопирования = Неопределено;
    КонецЕсли;        
КонецПроцедуры


&НаКлиенте
Процедура ГрафСхемаВыбор(Элемент)
    Если НЕ РежимРедактирования
        И Элемент.ТекущийЭлемент <> Неопределено
        Тогда
    	ОткрытьТочку(Элемент.ТекущийЭлемент.Имя);
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ГрафСхемаПриАктивизации(Элемент)
    Если РежимРедактирования Тогда
    	Возврат;
    КонецЕсли; 
    Эл = Элемент.ТекущийЭлемент;
    Если Эл <> Неопределено Тогда
        Имя = Эл.Имя;
    Иначе
        Имя = "";
    КонецЕсли; 
    ЗаполнитьСвязанныеРеквизиты(Имя);
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактированияПриИзменении(Элемент)
    Модифицированность = Истина;    
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    СформироватьКоличествоБП();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ОбновитьКарты" И Объект.Ссылка = Параметр Тогда
        Заполнить_ТабКэшДанных();
        ЗаполнитьГрафСхемуИзМД();
        ГрафСхемаПриАктивизации(Элементы.ПолеГрафСхема);
        
        ОбновлениеГрафСхемыНачать();
    КонецЕсли; 
КонецПроцедуры


 

&НаСервере
Функция ПолучитьВсеТочкиНаСервере()
	Запрос = Новый Запрос(
    "ВЫБРАТЬ
    |	ИА_БПТочкиМаршрута.Ссылка
    |ИЗ
    |	Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |	ИА_БПТочкиМаршрута.Владелец = &Владелец");
    Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции
 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    МассивТочек = ПолучитьВсеТочкиНаСервере();
    Для каждого Точка Из МассивТочек Цикл
    	ОповеститьОбИзменении(Точка);
    КонецЦикла; 
    Оповестить("ОбновитьКарты", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДанные(Команда)
    Элементы.ГруппаМаршрут.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
    Если НЕ Объект.Ссылка.Пустая() Тогда
        Отбор = Новый Структура("ИА_КартаМаршрутаБП, Стартован, Завершен"
        , Объект.Ссылка, Истина, Ложь);
        
        П = Новый Структура("Отбор", Отбор);
        ОткрытьФорму("БизнесПроцесс.ИА_БПНоситель.ФормаСписка", П,,ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли; 
КонецПроцедуры
